In [1]:
import seaborn as sns
from pyspark.ml import Pipeline
from pyspark.ml.feature import StringIndexer
from pyspark import SparkContext
from pyspark.sql import SQLContext # Main entry point for DataFrame and SQL functionality.

sc = SparkContext.getOrCreate()
sqlCtx = SQLContext(sc)

22/10/12 21:51:26 WARN Utils: Your hostname, ashish-Lenovo-ideapad-130-15IKB resolves to a loopback address: 127.0.1.1; using 192.168.1.131 instead (on interface wlp2s0)
22/10/12 21:51:26 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/10/12 21:51:27 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
22/10/12 21:51:28 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
22/10/12 21:51:28 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/sql/context.py:112: FutureWarning: Deprecated in 3.0.0. Use SparkSession.builder.getOrCreate() instead.
  warnings.warn(

In [2]:
import pyspark
print(pyspark.__version__)

3.3.0

In [3]:
with open('./input/student.csv', mode = 'r', encoding = 'utf8') as f:
    data = f.readlines()

In [4]:
data

['sno,FirstName,LASTNAME\n',
 'one,Ram,\n',
 'two,,Sharma\n',
 'three,Shyam,NA\n',
 'four,Kabir,\n',
 'five,NA,Singh\n']

In [5]:
import pandas as pd
df_student = pd.read_csv('./input/student.csv')

In [6]:
df_student.head()

     sno FirstName LASTNAME
0    one       Ram      NaN
1    two       NaN   Sharma
2  three     Shyam      NaN
3   four     Kabir      NaN
4   five       NaN    Singh

# When you load a Pandas DataFrame by reading from a CSV, blank values and 'NA' values are converted to 'NaN' values by default as shown above.

In [7]:
print(type(df_student))

<class 'pandas.core.frame.DataFrame'>

In [9]:
df_student.fillna('Not Applicable', inplace = True) # Handles blank and 'NA' values both.

In [10]:
df_student

     sno       FirstName        LASTNAME
0    one             Ram  Not Applicable
1    two  Not Applicable          Sharma
2  three           Shyam  Not Applicable
3   four           Kabir  Not Applicable
4   five  Not Applicable           Singh

In [11]:
from pyspark import pandas as ppd

WARNING:root:'PYARROW_IGNORE_TIMEZONE' environment variable was not set. It is required to set this environment variable to '1' in both driver and executor sides if you use pyarrow>=2.0.0. pandas-on-Spark will set it for you but it does not work if there is a Spark context already launched.

In [12]:
df_student_pyspark = ppd.read_csv('./input/student.csv')

/home/ashish/anaconda3/envs/mh/lib/python3.9/site-packages/pyspark/pandas/utils.py:975: PandasAPIOnSparkAdviceWarning: If `index_col` is not specified for `read_csv`, the default index is attached which can cause additional overhead.
  warnings.warn(message, PandasAPIOnSparkAdviceWarning)

In [13]:
type(df_student_pyspark)

pyspark.pandas.frame.DataFrame

In [14]:
df_student_pyspark

     sno FirstName LASTNAME
0    one       Ram     None
1    two      None   Sharma
2  three     Shyam       NA
3   four     Kabir     None
4   five        NA    Singh

In [17]:
df_student_pyspark.fillna('Not Applicable', inplace = True) # Handles blank (None) values.

In [18]:
df_student_pyspark

     sno       FirstName        LASTNAME
0    one             Ram  Not Applicable
1    two  Not Applicable          Sharma
2  three           Shyam              NA
3   four           Kabir  Not Applicable
4   five              NA           Singh